[Survived] BlockStatement
order-service-jest/lib/application/orders.js:4:34
 const { Order } = require('../domain/orders');
 
 class OrderUseCases {
-    async createOrder(orderData) {
-        const order = new Order();
-        order.customerId = orderData.customerId;
-        if (orderData.items) {
-            orderData.items.forEach(item => order.addItem(item));
-        }
-        await order.save();
-        return order;
-    }
+    async createOrder(orderData) {}
 
     async addOrderItem(orderId, item) {

[Survived] BlockStatement
order-service-jest/lib/application/orders.js:7:30
     async createOrder(orderData) {
         const order = new Order();
         order.customerId = orderData.customerId;
-        if (orderData.items) {
-            orderData.items.forEach(item => order.addItem(item));
-        }
+        if (orderData.items) {}
         await order.save();
         return order;

[Survived] ConditionalExpression
order-service-jest/lib/application/orders.js:7:13
     async createOrder(orderData) {
         const order = new Order();
         order.customerId = orderData.customerId;
-        if (orderData.items) {
+        if (false) {
             orderData.items.forEach(item => order.addItem(item));
         }

[Survived] ArrowFunction
order-service-jest/lib/application/orders.js:8:37
         const order = new Order();
         order.customerId = orderData.customerId;
         if (orderData.items) {
-            orderData.items.forEach(item => order.addItem(item));
+            orderData.items.forEach(() => undefined);
         }
         await order.save();

[Survived] BlockStatement
order-service-jest/lib/application/orders.js:14:39
         return order;
     }
 
-    async addOrderItem(orderId, item) {
-        const order = new Order(orderId);
-        await order.load();
-        order.addItem(item);
-        await order.save();
-        return order;
-    }
+    async addOrderItem(orderId, item) {}
 }
 
