[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:5:21
 const { OrdersRepository } = require('../infrastructure/database/orders-repository');
 
 class Order {
-    constructor(id) {
-        if (!id) {
-            id = uuid();
-        }
-        this._id = id;
-        this._items = new Array();
-        this.repository = new OrdersRepository();
-    }
+    constructor(id) {}
 
     get id() {

[Survived] BooleanLiteral
order-service-jest/lib/domain/orders.js:6:13
 
 class Order {
     constructor(id) {
-        if (!id) {
+        if (id) {
             id = uuid();
         }

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:6:18
 
 class Order {
     constructor(id) {
-        if (!id) {
-            id = uuid();
-        }
+        if (!id) {}
         this._id = id;
         this._items = new Array();

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:14:14
         this.repository = new OrdersRepository();
     }
 
-    get id() {
-        return this._id;
-    }
+    get id() {}
 
     get customerId() {

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:18:22
         return this._id;
     }
 
-    get customerId() {
-        return this._customerId;
-    }
+    get customerId() {}
 
     set customerId(customerId) {

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:22:32
         return this._customerId;
     }
 
-    set customerId(customerId) {
-        this._customerId = customerId || undefined;
-    }
+    set customerId(customerId) {}
 
     get items() {

[Survived] LogicalOperator
order-service-jest/lib/domain/orders.js:23:28
     }
 
     set customerId(customerId) {
-        this._customerId = customerId || undefined;
+        this._customerId = customerId && undefined;
     }
 

[Survived] ConditionalExpression
order-service-jest/lib/domain/orders.js:23:28
     }
 
     set customerId(customerId) {
-        this._customerId = customerId || undefined;
+        this._customerId = true;
     }
 

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:26:17
         this._customerId = customerId || undefined;
     }
 
-    get items() {
-        return this._items.slice();
-    }
+    get items() {}
 
     addItem(item) {

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:30:19
         return this._items.slice();
     }
 
-    addItem(item) {
-        if (item && item.productId) {
-            const existentItem = this._items.find(i => i.productId === item.productId);
-            if (existentItem) {
-                existentItem.amount += item.amount;
-            } else {
-                this._items.push(item);
-            }
-            return true;
-        }
-        return false;
-    }
+    addItem(item) {}
 
     updateItem(item) {

[Survived] ConditionalExpression
order-service-jest/lib/domain/orders.js:31:13
     }
 
     addItem(item) {
-        if (item && item.productId) {
+        if (false) {
             const existentItem = this._items.find(i => i.productId === item.productId);
             if (existentItem) {

[Survived] LogicalOperator
order-service-jest/lib/domain/orders.js:31:13
     }
 
     addItem(item) {
-        if (item && item.productId) {
+        if (item || item.productId) {
             const existentItem = this._items.find(i => i.productId === item.productId);
             if (existentItem) {

[Survived] ConditionalExpression
order-service-jest/lib/domain/orders.js:32:56
 
     addItem(item) {
         if (item && item.productId) {
-            const existentItem = this._items.find(i => i.productId === item.productId);
+            const existentItem = this._items.find(i => false);
             if (existentItem) {
                 existentItem.amount += item.amount;

[Survived] ArrowFunction
order-service-jest/lib/domain/orders.js:32:51
 
     addItem(item) {
         if (item && item.productId) {
-            const existentItem = this._items.find(i => i.productId === item.productId);
+            const existentItem = this._items.find(() => undefined);
             if (existentItem) {
                 existentItem.amount += item.amount;

[Survived] ConditionalExpression
order-service-jest/lib/domain/orders.js:33:17
     addItem(item) {
         if (item && item.productId) {
             const existentItem = this._items.find(i => i.productId === item.productId);
-            if (existentItem) {
+            if (false) {
                 existentItem.amount += item.amount;
             } else {

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:33:31
     addItem(item) {
         if (item && item.productId) {
             const existentItem = this._items.find(i => i.productId === item.productId);
-            if (existentItem) {
-                existentItem.amount += item.amount;
-            } else {
+            if (existentItem) {} else {
                 this._items.push(item);
             }

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:35:20
             const existentItem = this._items.find(i => i.productId === item.productId);
             if (existentItem) {
                 existentItem.amount += item.amount;
-            } else {
-                this._items.push(item);
-            }
+            } else {}
             return true;
         }

[Survived] BooleanLiteral
order-service-jest/lib/domain/orders.js:40:16
             }
             return true;
         }
-        return false;
+        return true;
     }
 

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:43:22
         return false;
     }
 
-    updateItem(item) {
-        let updated = false;
-        if (item && item.productId) {
-            const existentItem = this._items.find(i => i.productId === item.productId);
-            if (existentItem) {
-                existentItem.amount += item.amount;
-                updated = true;
-            }
-        }
-        return updated;
-    }
+    updateItem(item) {}
 
     removeItem(productId) {

[Survived] BooleanLiteral
order-service-jest/lib/domain/orders.js:44:23
     }
 
     updateItem(item) {
-        let updated = false;
+        let updated = true;
         if (item && item.productId) {
             const existentItem = this._items.find(i => i.productId === item.productId);

[Survived] ConditionalExpression
order-service-jest/lib/domain/orders.js:45:13
 
     updateItem(item) {
         let updated = false;
-        if (item && item.productId) {
+        if (true) {
             const existentItem = this._items.find(i => i.productId === item.productId);
             if (existentItem) {

[Survived] LogicalOperator
order-service-jest/lib/domain/orders.js:45:13
 
     updateItem(item) {
         let updated = false;
-        if (item && item.productId) {
+        if (item || item.productId) {
             const existentItem = this._items.find(i => i.productId === item.productId);
             if (existentItem) {

[Survived] ConditionalExpression
order-service-jest/lib/domain/orders.js:46:56
     updateItem(item) {
         let updated = false;
         if (item && item.productId) {
-            const existentItem = this._items.find(i => i.productId === item.productId);
+            const existentItem = this._items.find(i => true);
             if (existentItem) {
                 existentItem.amount += item.amount;

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:47:31
         let updated = false;
         if (item && item.productId) {
             const existentItem = this._items.find(i => i.productId === item.productId);
-            if (existentItem) {
-                existentItem.amount += item.amount;
-                updated = true;
-            }
+            if (existentItem) {}
         }
         return updated;

[Survived] BooleanLiteral
order-service-jest/lib/domain/orders.js:49:27
             const existentItem = this._items.find(i => i.productId === item.productId);
             if (existentItem) {
                 existentItem.amount += item.amount;
-                updated = true;
+                updated = false;
             }
         }

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:55:27
         return updated;
     }
 
-    removeItem(productId) {
-        let removed = false;
-        if (productId) {
-            const itemIndex = this._items.findIndex(i => i.productId === productId);
-            if (itemIndex > -1) {
-                this._items.splice(itemIndex, 1);
-            }
-        }
-        return removed;
-    }
+    removeItem(productId) {}
 
     async save() {

[Survived] BooleanLiteral
order-service-jest/lib/domain/orders.js:56:23
     }
 
     removeItem(productId) {
-        let removed = false;
+        let removed = true;
         if (productId) {
             const itemIndex = this._items.findIndex(i => i.productId === productId);

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:57:24
 
     removeItem(productId) {
         let removed = false;
-        if (productId) {
-            const itemIndex = this._items.findIndex(i => i.productId === productId);
-            if (itemIndex > -1) {
-                this._items.splice(itemIndex, 1);
-            }
-        }
+        if (productId) {}
         return removed;
     }

[Survived] ConditionalExpression
order-service-jest/lib/domain/orders.js:57:13
 
     removeItem(productId) {
         let removed = false;
-        if (productId) {
+        if (false) {
             const itemIndex = this._items.findIndex(i => i.productId === productId);
             if (itemIndex > -1) {

[Survived] ConditionalExpression
order-service-jest/lib/domain/orders.js:58:58
     removeItem(productId) {
         let removed = false;
         if (productId) {
-            const itemIndex = this._items.findIndex(i => i.productId === productId);
+            const itemIndex = this._items.findIndex(i => false);
             if (itemIndex > -1) {
                 this._items.splice(itemIndex, 1);

[Survived] ConditionalExpression
order-service-jest/lib/domain/orders.js:58:58
     removeItem(productId) {
         let removed = false;
         if (productId) {
-            const itemIndex = this._items.findIndex(i => i.productId === productId);
+            const itemIndex = this._items.findIndex(i => true);
             if (itemIndex > -1) {
                 this._items.splice(itemIndex, 1);

[Survived] EqualityOperator
order-service-jest/lib/domain/orders.js:59:17
         let removed = false;
         if (productId) {
             const itemIndex = this._items.findIndex(i => i.productId === productId);
-            if (itemIndex > -1) {
+            if (itemIndex >= -1) {
                 this._items.splice(itemIndex, 1);
             }

[Survived] UnaryOperator
order-service-jest/lib/domain/orders.js:59:29
         let removed = false;
         if (productId) {
             const itemIndex = this._items.findIndex(i => i.productId === productId);
-            if (itemIndex > -1) {
+            if (itemIndex > +1) {
                 this._items.splice(itemIndex, 1);
             }

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:66:18
         return removed;
     }
 
-    async save() {
-        return this.repository.persist({
-            id: this.id,
-            customerId: this.customerId,
-            items: this.items
-        });
-    }
+    async save() {}
 
     async load() {

[Survived] ObjectLiteral
order-service-jest/lib/domain/orders.js:67:40
     }
 
     async save() {
-        return this.repository.persist({
-            id: this.id,
-            customerId: this.customerId,
-            items: this.items
-        });
+        return this.repository.persist({});
     }
 

[Survived] BlockStatement
order-service-jest/lib/domain/orders.js:74:18
         });
     }
 
-    async load() {
-        const orderData = await this.repository.load(this.id);
-        this._items = orderData.items || [];
-        this.customerId = orderData.customerId;
-        return this;
-    }
+    async load() {}
 }
 

[Survived] ConditionalExpression
order-service-jest/lib/domain/orders.js:76:23
 
     async load() {
         const orderData = await this.repository.load(this.id);
-        this._items = orderData.items || [];
+        this._items = true;
         this.customerId = orderData.customerId;
         return this;

[Survived] LogicalOperator
order-service-jest/lib/domain/orders.js:76:23
 
     async load() {
         const orderData = await this.repository.load(this.id);
-        this._items = orderData.items || [];
+        this._items = orderData.items && [];
         this.customerId = orderData.customerId;
         return this;
