[Survived] BlockStatement
lib/infrastructure/database/mongo.js:4:35
 const { MongoClient } = require('mongodb');
 
 class MongoDB {
-    static async getMongoClient() {
-        if (!MongoDB.mongoClient) {
-            const mongoURL = process.env.MONGO_DB_URL || 'mongodb://localhost:27017/orders';
-            MongoDB.mongoClient = await MongoClient.connect(mongoURL, { useNewUrlParser: true, useUnifiedTopology: true });
-        }
-        return MongoDB.mongoClient;
-    }
+    static async getMongoClient() {}
 }
 

[Survived] BlockStatement
lib/infrastructure/database/mongo.js:5:35
 
 class MongoDB {
     static async getMongoClient() {
-        if (!MongoDB.mongoClient) {
-            const mongoURL = process.env.MONGO_DB_URL || 'mongodb://localhost:27017/orders';
-            MongoDB.mongoClient = await MongoClient.connect(mongoURL, { useNewUrlParser: true, useUnifiedTopology: true });
-        }
+        if (!MongoDB.mongoClient) {}
         return MongoDB.mongoClient;
     }

[Survived] ConditionalExpression
lib/infrastructure/database/mongo.js:5:13
 
 class MongoDB {
     static async getMongoClient() {
-        if (!MongoDB.mongoClient) {
+        if (true) {
             const mongoURL = process.env.MONGO_DB_URL || 'mongodb://localhost:27017/orders';
             MongoDB.mongoClient = await MongoClient.connect(mongoURL, { useNewUrlParser: true, useUnifiedTopology: true });

[Survived] LogicalOperator
lib/infrastructure/database/mongo.js:6:30
 class MongoDB {
     static async getMongoClient() {
         if (!MongoDB.mongoClient) {
-            const mongoURL = process.env.MONGO_DB_URL || 'mongodb://localhost:27017/orders';
+            const mongoURL = process.env.MONGO_DB_URL && 'mongodb://localhost:27017/orders';
             MongoDB.mongoClient = await MongoClient.connect(mongoURL, { useNewUrlParser: true, useUnifiedTopology: true });
         }

[Survived] ConditionalExpression
lib/infrastructure/database/mongo.js:6:30
 class MongoDB {
     static async getMongoClient() {
         if (!MongoDB.mongoClient) {
-            const mongoURL = process.env.MONGO_DB_URL || 'mongodb://localhost:27017/orders';
+            const mongoURL = false;
             MongoDB.mongoClient = await MongoClient.connect(mongoURL, { useNewUrlParser: true, useUnifiedTopology: true });
         }

[Survived] BooleanLiteral
lib/infrastructure/database/mongo.js:7:90
     static async getMongoClient() {
         if (!MongoDB.mongoClient) {
             const mongoURL = process.env.MONGO_DB_URL || 'mongodb://localhost:27017/orders';
-            MongoDB.mongoClient = await MongoClient.connect(mongoURL, { useNewUrlParser: true, useUnifiedTopology: true });
+            MongoDB.mongoClient = await MongoClient.connect(mongoURL, { useNewUrlParser: false, useUnifiedTopology: true });
         }
         return MongoDB.mongoClient;

[Survived] BooleanLiteral
lib/infrastructure/database/mongo.js:7:116
     static async getMongoClient() {
         if (!MongoDB.mongoClient) {
             const mongoURL = process.env.MONGO_DB_URL || 'mongodb://localhost:27017/orders';
-            MongoDB.mongoClient = await MongoClient.connect(mongoURL, { useNewUrlParser: true, useUnifiedTopology: true });
+            MongoDB.mongoClient = await MongoClient.connect(mongoURL, { useNewUrlParser: true, useUnifiedTopology: false });
         }
         return MongoDB.mongoClient;
