[Killed] BlockStatement
courses-tests/order-service-jest/lib/index.js:11:15
 const app = express();
 
 server.configure(app, apiSpec, port)
-  .then(() => {
-    console.log(`Listening on port ${port}`);
-  }).catch((error) => {
+  .then(() => {}).catch((error) => {
     console.error(`Error starting server.`);
     console.error(error);

[Killed] BlockStatement
courses-tests/order-service-jest/lib/index.js:13:23
 server.configure(app, apiSpec, port)
   .then(() => {
     console.log(`Listening on port ${port}`);
-  }).catch((error) => {
-    console.error(`Error starting server.`);
-    console.error(error);
-  });
+  }).catch((error) => {});
 
 module.exports = app;
