[Killed] BlockStatement
lib/infrastructure/database/orders-repository.js:4:21
 const MongoDB = require('./mongo');
 
 class OrdersRepository {
-    async _orders() {
-        if (!this.ordersCollection) {
-            const mongoClient = await MongoDB.getMongoClient();
-            this.ordersCollection = mongoClient.db().collection('orders');
-        }
-        return this.ordersCollection;
-    }
+    async _orders() {}
 
     async persist(order) {

[Killed] ConditionalExpression
lib/infrastructure/database/orders-repository.js:5:13
 
 class OrdersRepository {
     async _orders() {
-        if (!this.ordersCollection) {
+        if (true) {
             const mongoClient = await MongoDB.getMongoClient();
             this.ordersCollection = mongoClient.db().collection('orders');

[Killed] BlockStatement
lib/infrastructure/database/orders-repository.js:5:37
 
 class OrdersRepository {
     async _orders() {
-        if (!this.ordersCollection) {
-            const mongoClient = await MongoDB.getMongoClient();
-            this.ordersCollection = mongoClient.db().collection('orders');
-        }
+        if (!this.ordersCollection) {}
         return this.ordersCollection;
     }

[Killed] StringLiteral
lib/infrastructure/database/orders-repository.js:7:65
     async _orders() {
         if (!this.ordersCollection) {
             const mongoClient = await MongoDB.getMongoClient();
-            this.ordersCollection = mongoClient.db().collection('orders');
+            this.ordersCollection = mongoClient.db().collection("");
         }
         return this.ordersCollection;

[Killed] BlockStatement
lib/infrastructure/database/orders-repository.js:12:26
         return this.ordersCollection;
     }
 
-    async persist(order) {
-        const ordersCollection = await this._orders();
-        return ordersCollection.updateOne({ id: order.id }, { $set: order }, { upsert: true });
-    }
+    async persist(order) {}
 
     async load(orderId) {

[Killed] BooleanLiteral
lib/infrastructure/database/orders-repository.js:14:88
 
     async persist(order) {
         const ordersCollection = await this._orders();
-        return ordersCollection.updateOne({ id: order.id }, { $set: order }, { upsert: true });
+        return ordersCollection.updateOne({ id: order.id }, { $set: order }, { upsert: false });
     }
 

[Killed] ObjectLiteral
lib/infrastructure/database/orders-repository.js:14:78
 
     async persist(order) {
         const ordersCollection = await this._orders();
-        return ordersCollection.updateOne({ id: order.id }, { $set: order }, { upsert: true });
+        return ordersCollection.updateOne({ id: order.id }, { $set: order }, {});
     }
 

[Killed] BlockStatement
lib/infrastructure/database/orders-repository.js:17:25
         return ordersCollection.updateOne({ id: order.id }, { $set: order }, { upsert: true });
     }
 
-    async load(orderId) {
-        const ordersCollection = await this._orders();
-        return ordersCollection.findOne({ 'id': orderId });
-    }
+    async load(orderId) {}
 }
 
