[Survived] BlockStatement
lib/infrastructure/server/server.js:7:46
 const logger = require('morgan');
 const path = require('path');
 
-function errorHandler(error, req, res, next) {
-    if (res.headersSent) { // important to allow default error handler to close connection if headers already sent
-        return next(error);
-    }
-    if (error) {
-        res.status(error.status || 500).json({
-            message: error.message,
-            errors: error.errors,
-        });
-        console.error(`Error: ${error.message}`);
-        console.error(error);
-    } else {
-        next(error);
-    }
-}
+function errorHandler(error, req, res, next) {}
 
 async function configure(app, apiSpec, port) {

[Survived] BlockStatement
lib/infrastructure/server/server.js:8:26
 const path = require('path');
 
 function errorHandler(error, req, res, next) {
-    if (res.headersSent) { // important to allow default error handler to close connection if headers already sent
-        return next(error);
-    }
+    if (res.headersSent) {}
     if (error) {
         res.status(error.status || 500).json({

[Survived] ConditionalExpression
lib/infrastructure/server/server.js:8:9
 const path = require('path');
 
 function errorHandler(error, req, res, next) {
-    if (res.headersSent) { // important to allow default error handler to close connection if headers already sent
+    if (true) { // important to allow default error handler to close connection if headers already sent
         return next(error);
     }

[Survived] BlockStatement
lib/infrastructure/server/server.js:11:16
     if (res.headersSent) { // important to allow default error handler to close connection if headers already sent
         return next(error);
     }
-    if (error) {
-        res.status(error.status || 500).json({
-            message: error.message,
-            errors: error.errors,
-        });
-        console.error(`Error: ${error.message}`);
-        console.error(error);
-    } else {
+    if (error) {} else {
         next(error);
     }

[Survived] ConditionalExpression
lib/infrastructure/server/server.js:11:9
     if (res.headersSent) { // important to allow default error handler to close connection if headers already sent
         return next(error);
     }
-    if (error) {
+    if (true) {
         res.status(error.status || 500).json({
             message: error.message,

[Survived] LogicalOperator
lib/infrastructure/server/server.js:12:20
         return next(error);
     }
     if (error) {
-        res.status(error.status || 500).json({
+        res.status(error.status && 500).json({
             message: error.message,
             errors: error.errors,

[Survived] ConditionalExpression
lib/infrastructure/server/server.js:12:20
         return next(error);
     }
     if (error) {
-        res.status(error.status || 500).json({
+        res.status(false).json({
             message: error.message,
             errors: error.errors,

[Survived] BlockStatement
lib/infrastructure/server/server.js:18:12
         });
         console.error(`Error: ${error.message}`);
         console.error(error);
-    } else {
-        next(error);
-    }
+    } else {}
 }
 

[Survived] BlockStatement
lib/infrastructure/server/server.js:23:46
     }
 }
 
-async function configure(app, apiSpec, port) {
-    app.use(bodyParser.json());
-    app.use(logger('dev'));
-
-    const openApiValidator = OpenApiValidator.middleware({
-        apiSpec,
-        operationHandlers: path.join(__dirname, '../../interfaces'),
-        validateRequests: true,
-        validateFormats: 'full',
-        coerceTypes: false
-    });
-    app.use(openApiValidator);
-
-    app.use(errorHandler);
-
-    http.createServer(app).listen(port);
-
-    return app;
-}
+async function configure(app, apiSpec, port) {}
 
 module.exports = {

[Survived] StringLiteral
lib/infrastructure/server/server.js:25:20
 
 async function configure(app, apiSpec, port) {
     app.use(bodyParser.json());
-    app.use(logger('dev'));
+    app.use(logger(""));
 
     const openApiValidator = OpenApiValidator.middleware({

[Survived] BooleanLiteral
lib/infrastructure/server/server.js:30:27
     const openApiValidator = OpenApiValidator.middleware({
         apiSpec,
         operationHandlers: path.join(__dirname, '../../interfaces'),
-        validateRequests: true,
+        validateRequests: false,
         validateFormats: 'full',
         coerceTypes: false

[Survived] BooleanLiteral
lib/infrastructure/server/server.js:32:22
         operationHandlers: path.join(__dirname, '../../interfaces'),
         validateRequests: true,
         validateFormats: 'full',
-        coerceTypes: false
+        coerceTypes: true
     });
     app.use(openApiValidator);
