[Survived] BlockStatement
order-service-jest/lib/interfaces/orders-endpoints.js:5:45
 
 
 module.exports = {
-    createOrder: async (call, res, next) => {
-        try {
-            const orderUseCases = new OrderUseCases();
-            const order = await orderUseCases.createOrder(call.body);
-            res.writeHead(201, { 'Location': `/orders/${order.id}` });
-            res.end();
-        } catch (error) {
-            next(error);
-        }
-    },
+    createOrder: async (call, res, next) => {},
 
     createOrderItem: async (call, res, next) => {

[Survived] BlockStatement
order-service-jest/lib/interfaces/orders-endpoints.js:6:13
 
 module.exports = {
     createOrder: async (call, res, next) => {
-        try {
-            const orderUseCases = new OrderUseCases();
-            const order = await orderUseCases.createOrder(call.body);
-            res.writeHead(201, { 'Location': `/orders/${order.id}` });
-            res.end();
-        } catch (error) {
+        try {} catch (error) {
             next(error);
         }

[Survived] BlockStatement
order-service-jest/lib/interfaces/orders-endpoints.js:11:25
             const order = await orderUseCases.createOrder(call.body);
             res.writeHead(201, { 'Location': `/orders/${order.id}` });
             res.end();
-        } catch (error) {
-            next(error);
-        }
+        } catch (error) {}
     },
 

[Survived] BlockStatement
order-service-jest/lib/interfaces/orders-endpoints.js:16:49
         }
     },
 
-    createOrderItem: async (call, res, next) => {
-        try {
-            const orderId = call.params.orderId;
-            const item = call.body;
-
-            const orderUseCases = new OrderUseCases();
-            await orderUseCases.addOrderItem(orderId, item);
-
-            res.status(200).send(item);
-        } catch (error) {
-            next(error);
-        }
-    }
+    createOrderItem: async (call, res, next) => {}
 };
 

[Survived] BlockStatement
order-service-jest/lib/interfaces/orders-endpoints.js:17:13
     },
 
     createOrderItem: async (call, res, next) => {
-        try {
-            const orderId = call.params.orderId;
-            const item = call.body;
-
-            const orderUseCases = new OrderUseCases();
-            await orderUseCases.addOrderItem(orderId, item);
-
-            res.status(200).send(item);
-        } catch (error) {
+        try {} catch (error) {
             next(error);
         }

[Survived] BlockStatement
order-service-jest/lib/interfaces/orders-endpoints.js:25:25
             await orderUseCases.addOrderItem(orderId, item);
 
             res.status(200).send(item);
-        } catch (error) {
-            next(error);
-        }
+        } catch (error) {}
     }
 };
